run/cokeCombustion/gridSizeSensitivityAnalysis/T773_Pe1e-2_medium_finer3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
900
(
(1.2716e-05 0 0)
(1.2716e-05 0 0)
(3.80844e-05 0 0)
(6.33679e-05 0 0)
(6.33679e-05 0 0)
(8.85665e-05 0 0)
(0.00011368 0 0)
(0.00011368 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
